{
    "experiences": [
        {
            "company": "Kalunga",
            "role": "Full-Time Mobile Developer",
            "duration": "Oct 2023 - Present",
            "image": "assets/companies/kalunga_logo.png",
            "link": "https://apps.apple.com/br/app/kalunga/id467359104",
            "color": "0xFF000000",
            "description": [
                {
                    "item": "intuitive and responsive user interface for the login and registration screen."
                },
                {
                    "item": "Collaborated with the backend team to integrate RESTful APIs into the application."
                },
                {
                    "item": "Implemented biometric authentication using the Android biometric authentication API and the Touch ID / Face ID framework on iOS."
                },
                {
                    "item": "Configured and integrated push notification services such as Firebase Cloud Messaging (Android) and Apple Push Notification Service (iOS)"
                }
            ]
        },
        {
            "company": "Lojong",
            "role": "Part-Time Flutter Developer",
            "duration": "Sept 2022 - Oct 2023",
            "image": "assets/companies/lojong_logo.png",
            "link": "https://play.google.com/store/apps/details?id=br.com.lojong",
            "color": "0xFFE09090",
            "description": [
                {
                    "item": "Collaborate with the team to create new features and screens for Lojong's mobile app."
                },
                {
                    "item": "Contribute to the migration of native Android to Flutter, following the MVVM architecture proposed by the team."
                },
                {
                    "item": "Ensure code quality and maintainability by following best practices and participating in code reviews."
                },
                {
                    "item": "Communicate effectively with team members to ensure the timely delivery of new features."
                }
            ]
        },
        {
            "company": "SUNDAY",
            "role": "Sênior Flutter Developer",
            "duration": "Apr 2021 - Feb 2023",
            "image": "assets/companies/sunday_logo.png",
            "link": "",
            "color": "0xFFFACD01",
            "description": [
                {
                    "item": "Responsible for uploading the app to the PlayStore and ensuring its smooth functioning."
                },
                {
                    "item": "Developed and implemented various new features, including treatment of APIs, refactoring of existing codes, authentication of users, chat functionality, video player and secure payment processing with Stripe 3D Secure."
                },
                {
                    "item": "Maintained up-to-date knowledge of best practices and emerging technologies in mobile app development."
                },
                {
                    "item": "Ability to work effectively as part of a remote team, demonstrating excellent communication skills and attention to detail."
                }
            ]
        },
        {
            "company": "Ubistart",
            "role": "Flutter Developer Support",
            "duration": "Sept 2021 - Dec 2022",
            "image": "assets/companies/ubistart_logo.png",
            "link": "https://www.ubistart.com/",
            "color": "0xFFFFFFFF",
            "description": [
                {
                    "item": "Experience with providing technical assistance and mentor in the context of mobile app development."
                },
                {
                    "item": "Participate in the Flutter interview process for new projects"
                },
                {
                    "item": "Ensure code quality and maintainability by making code reviews"
                }
            ]
        },
        {
            "company": "Ubistart",
            "role": "Flutter Developer",
            "duration": "Sept 2020 - Feb 2021",
            "image": "assets/companies/ubistart_logo.png",
            "link": "https://www.ubistart.com/",
            "color": "0xFFFFFFFF",
            "description": [
                {
                    "item": "Collaborated with a project manager and director to develop a mobile app for license plate detection project during 5 months using Dart / Flutter."
                },
                {
                    "item": "Integrated Firebase's Machine Learning Kit for camera-based license plate detection."
                },
                {
                    "item": "Integrated APIs for data retrieval and manipulation."
                },
                {
                    "item": "Ensured high-quality code and adherence to best practices."
                }
            ]
        },
        {
            "company": "PetTech",
            "role": "Flutter Developer (Freelancer)",
            "duration": "Mar 2020 - Apr 2020",
            "image": "assets/companies/pettech_logo.jpeg",
            "link": "",
            "color": "0xFF42A5F5",
            "description": [
                {
                    "item": "Developed a mobile app from scratch using Flutter for pet owners."
                },
                {
                    "item": "Implemented features such as login process, password recovery, Google Maps integration with geolocation API, pet cards with pet information, and more."
                },
                {
                    "item": "Communicated effectively with the client to understand their needs and provide regular progress updates."
                }
            ]
        }
    ]
}